## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.gke-cinema.google_container_cluster.primary has changed
!   resource "google_container_cluster" "primary" {
        id                          = "projects/terrateam-362405/locations/us-central1/clusters/cinema"
        name                        = "cinema"
        # (27 unchanged attributes hidden)

+       node_config {
+           disk_size_gb      = 15
+           disk_type         = "pd-standard"
+           guest_accelerator = []
+           image_type        = "COS_CONTAINERD"
+           labels            = {
+               "cluster_name" = "cinema"
+               "node_pool"    = "core"
            }
+           local_ssd_count   = 0
+           machine_type      = "e2-highcpu-4"
+           metadata          = {
+               "cluster_name"             = "cinema"
+               "disable-legacy-endpoints" = "true"
+               "node_pool"                = "core"
            }
+           oauth_scopes      = [
+               "https://www.googleapis.com/auth/logging.write",
+               "https://www.googleapis.com/auth/monitoring",
            ]
+           preemptible       = false
+           service_account   = "terrateam-tf@terrateam-362405.iam.gserviceaccount.com"
+           spot              = false
+           tags              = [
+               "gke-cinema",
+               "gke-cinema-core",
            ]
+           taint             = []

+           shielded_instance_config {
+               enable_integrity_monitoring = true
+               enable_secure_boot          = false
            }

+           workload_metadata_config {
+               mode = "GKE_METADATA"
            }
        }

+       node_pool {
+           initial_node_count          = 1
+           instance_group_urls         = [
+               "https://www.googleapis.com/compute/v1/projects/terrateam-362405/zones/us-central1-a/instanceGroupManagers/gke-cinema-core-d283edfc-grp",
+               "https://www.googleapis.com/compute/v1/projects/terrateam-362405/zones/us-central1-b/instanceGroupManagers/gke-cinema-core-c273229c-grp",
            ]
+           managed_instance_group_urls = [
+               "https://www.googleapis.com/compute/v1/projects/terrateam-362405/zones/us-central1-a/instanceGroups/gke-cinema-core-d283edfc-grp",
+               "https://www.googleapis.com/compute/v1/projects/terrateam-362405/zones/us-central1-b/instanceGroups/gke-cinema-core-c273229c-grp",
            ]
+           max_pods_per_node           = 65
+           name                        = "core"
+           node_count                  = 1
+           node_locations              = [
+               "us-central1-a",
+               "us-central1-b",
            ]
+           version                     = "1.24.3-gke.2100"

+           autoscaling {
+               max_node_count       = 4
+               min_node_count       = 2
+               total_max_node_count = 0
+               total_min_node_count = 0
            }

+           management {
+               auto_repair  = true
+               auto_upgrade = true
            }

+           node_config {
+               disk_size_gb      = 15
+               disk_type         = "pd-standard"
+               guest_accelerator = []
+               image_type        = "COS_CONTAINERD"
+               labels            = {
+                   "cluster_name" = "cinema"
+                   "node_pool"    = "core"
                }
+               local_ssd_count   = 0
+               machine_type      = "e2-highcpu-4"
+               metadata          = {
+                   "cluster_name"             = "cinema"
+                   "disable-legacy-endpoints" = "true"
+                   "node_pool"                = "core"
                }
+               oauth_scopes      = [
+                   "https://www.googleapis.com/auth/logging.write",
+                   "https://www.googleapis.com/auth/monitoring",
                ]
+               preemptible       = false
+               service_account   = "terrateam-tf@terrateam-362405.iam.gserviceaccount.com"
+               spot              = false
+               tags              = [
+                   "gke-cinema",
+                   "gke-cinema-core",
                ]
+               taint             = []

+               shielded_instance_config {
+                   enable_integrity_monitoring = true
+                   enable_secure_boot          = false
                }

+               workload_metadata_config {
+                   mode = "GKE_METADATA"
                }
            }

+           upgrade_settings {
+               max_surge       = 1
+               max_unavailable = 0
            }
        }

        # (17 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!   update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_service_account.gke-external-dns will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_service_account" "gke-external-dns" {
+       account_id   = "external-dns@terrateam-362405.iam.gserviceaccount.com"
+       display_name = (known after apply)
+       email        = (known after apply)
+       id           = (known after apply)
+       name         = (known after apply)
+       unique_id    = (known after apply)
    }

  # google_service_account_key.external-dns must be replaced
-/+ resource "google_service_account_key" "external-dns" {
!       id                 = "projects/terrateam-362405/serviceAccounts/external-dns@terrateam-362405.iam.gserviceaccount.com/keys/ec20643c8afb160babfcc977d7e59e5c2a4c71ab" -> (known after apply)
!       name               = "projects/terrateam-362405/serviceAccounts/external-dns@terrateam-362405.iam.gserviceaccount.com/keys/ec20643c8afb160babfcc977d7e59e5c2a4c71ab" -> (known after apply)
!       private_key        = (sensitive value)
!       public_key         = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMvRENDQWVTZ0F3SUJBZ0lJRG1wQTM5UjdEeEV3RFFZSktvWklodmNOQVFFRkJRQXdJREVlTUJ3R0ExVUUKQXhNVk1UQTFPVGt5TmpFd01UZ3pOemN6TWprM016UXlNQ0FYRFRJeU1Ea3hPREU0TkRVd01sb1lEems1T1RreApNak14TWpNMU9UVTVXakFnTVI0d0hBWURWUVFERXhVeE1EVTVPVEkyTVRBeE9ETTNOek15T1Rjek5ESXdnZ0VpCk1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLQW9JQkFRQzJ0TUNBL2pxSW54WFhMM2VwaTZtQnZWUXYKU3I5OGdMUGh6Z2pscWJKcDM3REFMSHU0TStKWDl2OExvYlh3WG9HQkl6cVhCeHNDUVhqVnRuQ1lsajVjUnliVwp6bnQxRkN0M1RoQ0lubUl1MWFWcXRqd1o3Q2Y3T2lNSVEzK09zcFdFYml3eDVIdnhKUy81aVM3V0svYVhZTSs4CktFbXJVd2MyY1FhOWZ4WExQcExCaTV3NlB0U1hKWlV5Sjh5SXNRNTE0OHIzejFhb0ZSSVBzZkpLNzU4WlN3KzMKekxjMXFYRURQTkEzUWNLbk93dUkyTUZoeWZSQWs0MG10MGNXTDlnOHEzdmFXcW1VL1NCdmJabFNicm0yOVVjcAp5UHUvbG9xbXUzTTNoNFFyeEoxQTdidGpEQXNyeHYyV0FmYk11dmtPWEJ5Sm5xOHY4bDZqRXNsK3JBNG5BZ01CCkFBR2pPREEyTUF3R0ExVWRFd0VCL3dRQ01BQXdEZ1lEVlIwUEFRSC9CQVFEQWdlQU1CWUdBMVVkSlFFQi93UU0KTUFvR0NDc0dBUVVGQndNQ01BMEdDU3FHU0liM0RRRUJCUVVBQTRJQkFRQlpwY0tkTUxBbVpHeklQNDdkbTZOOApDanB3QzdPdEVJVlF2UEJjMDB2MXk2L2U3Q2xjR0JETVpIbWpaQzMycWdSRVh5NXhORkh0MjlDaW1jcUVLekNXClpmdDQ5aWg3OWEwVCtYK2F0b2FEYkN0cDBIZ25JMkRoSUZJWEpMYi9ERE9lWVBaLzNvRm5ZMk5paXlIVGs3RFkKcW9MSzZ4b2pGNVNPK2IvSlhMOWlXeEY0YXRzTUJSTmt2eExoVU1XeVdqQ0xLS0tVZjY4eVBBNENhZzVwSUZqNApIN05XbkNrcUhnWHBNcEx0MEJzVE9UVmt0L2hiY1plbHU1ZDdmYmhtMHFZT3loYTdyOWJ6eGpHM3RtSGVDZ3gxCnBxWWk4WHVJZjNESGt0NmJvK1JEQW1IRTlBczdSUUhCNzVXUGs1dXJqR00rWmduNjFrc0pvaWdwVGR2TFpOQzYKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> (known after apply)
!       service_account_id = "projects/terrateam-362405/serviceAccounts/external-dns@terrateam-362405.iam.gserviceaccount.com" -> (known after apply) # forces replacement
!       valid_after        = "2022-09-18T18:45:02Z" -> (known after apply)
!       valid_before       = "9999-12-31T23:59:59Z" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # kubernetes_secret.external-dns-credentials will be updated in-place
!   resource "kubernetes_secret" "external-dns-credentials" {
!       data      = (sensitive value)
        id        = "dns/external-dns"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.gke-cinema.google_container_node_pool.pools["core"] will be updated in-place
!   resource "google_container_node_pool" "pools" {
        id                          = "projects/terrateam-362405/locations/us-central1/clusters/cinema/nodePools/core"
        name                        = "core"
        # (10 unchanged attributes hidden)

!       autoscaling {
!           min_node_count       = 2 -> 4
            # (3 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
